Catalogs/БП_ГруппыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>БП_ГруппыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереченьКонтрагентовТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БП_ГруппыКонтрагентов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БП_ГруппыКонтрагентов.Ссылка,
	|	БП_ГруппыКонтрагентов.ОсновнойКонтрагент
	|ИЗ
	|	Справочник.БП_ГруппыКонтрагентов КАК БП_ГруппыКонтрагентов
	|ГДЕ
	|	БП_ГруппыКонтрагентов.ОсновнойКонтрагент = &ОсновнойКонтрагент
	|	И НЕ БП_ГруппыКонтрагентов.ПометкаУдаления
	|	И БП_ГруппыКонтрагентов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ОсновнойКонтрагент", ОсновнойКонтрагент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если Запрос.Выполнить().Выгрузить().Количество() тогда
		Сообщить("Запис не унікальний! В даному довіднику уже є не помічений на видалення запис з таким основним контрагентом!");	
		Отказ = Истина;	
	КонецЕсли; 
	
	ПереченьКонтрагентовТекст = "";
	
	Для каждого Стр из Контрагенты цикл
		ПереченьКонтрагентовТекст = ?(ПереченьКонтрагентовТекст = "", ПереченьКонтрагентовТекст, ПереченьКонтрагентовТекст + "; ") + Строка(Стр.Контрагент);	
	КонецЦикла;

КонецПроцедуры
